# Subquery Practice

## Type I - Uncorrelated Subquery
A uncorrelated subquery is a type of subquery where inner query doesnâ€™t depend upon the outer query for its execution. It can complete its execution as a standalone query

Recall the US States and Administrative Divisions tables from a previous lesson.

In [1]:
%load_ext sql
%sql postgres://dsa_ro_user:readonly@pgsql.dsa.lan/dsa_ro

'Connected: dsa_ro_user@dsa_ro'

In [2]:
%sql SELECT * FROM util_us_states LIMIT 5

 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dsa_ro
5 rows affected.

[('AK', 2, 'ALASKA'),
 ('AL', 1, 'ALABAMA'),
 ('AR', 5, 'ARKANSAS'),
 ('AS', 60, 'AMERICAN SAMOA'),
 ('AZ', 4, 'ARIZONA')]

In [3]:
%sql SELECT * FROM us_second_order_divisions LIMIT 5

 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dsa_ro
5 rows affected.

[(1, '001', 'Autauga'),
 (1, '003', 'Baldwin'),
 (1, '005', 'Barbour'),
 (1, '007', 'Bibb'),
 (1, '009', 'Blount')]

## Q1) Use a type 1 nested query to do the following:
Write a SELECT statement that returns the state with the highest number of counties

In [12]:
SELECT  COUNT(state_number_code) in ( 
    SELECT state_number_code
    FROM us_second_order_divisions
    WHERE  COUNT(*) = MAX(COUNT(*))
    GROUP BY state_number_code
    );

SyntaxError: invalid syntax (<ipython-input-12-bd6f20ebf77a>, line 1)

## Q2) Use a type 1 nested query to do the following:<br>
 Write a SELECT statement that returns the state with the fewest number of counties

In [14]:
SELECT COUNT(state_number_code) in (
    SELECT state_number_code
    FROM us_second_order_divisions
    WHERE  COUNT(*) = MAX(COUNT(*))
    GROUP BY state_number_code
    );

SyntaxError: invalid syntax (<ipython-input-14-3a0e688ca335>, line 1)

## Type II - Correlated Subquery  or the nested loops of SQL 

A correlated subquery is a type of query, where inner query depends upon the outcome of the outer query in order to perform its execution.

#### Using the Survey Database (again)

Survey database from opensource: http://swcarpentry.github.io/sql-novice-survey/

<div class="row">
<div class="col-md-6">

<p><strong>Person</strong>: people who took readings.</p>

<table>
<thead>
<tr>
<th>id</th>
<th>personal</th>
<th>family</th>
</tr>
</thead>
<tbody>
<tr>
<td>dyer</td>
<td>William</td>
<td>Dyer</td>
</tr>
<tr>
<td>pb</td>
<td>Frank</td>
<td>Pabodie</td>
</tr>
<tr>
<td>lake</td>
<td>Anderson</td>
<td>Lake</td>
</tr>
<tr>
<td>roe</td>
<td>Valentina</td>
<td>Roerich</td>
</tr>
<tr>
<td>danforth</td>
<td>Frank</td>
<td>Danforth</td>
</tr>
</tbody>
</table>

<p><strong>Site</strong>: locations where readings were taken.</p>

<table>
<thead>
<tr>
<th>name</th>
<th>lat</th>
<th>long</th>
</tr>
</thead>
<tbody>
<tr>
<td>DR-1</td>
<td>-49.85</td>
<td>-128.57</td>
</tr>
<tr>
<td>DR-3</td>
<td>-47.15</td>
<td>-126.72</td>
</tr>
<tr>
<td>MSK-4</td>
<td>-48.87</td>
<td>-123.4</td>
</tr>
</tbody>
</table>

<p><strong>Visited</strong>: when readings were taken at specific sites.</p>

<table>
<thead>
<tr>
<th>id</th>
<th>site</th>
<th>dated</th>
</tr>
</thead>
<tbody>
<tr>
<td>619</td>
<td>DR-1</td>
<td>1927-02-08</td>
</tr>
<tr>
<td>622</td>
<td>DR-1</td>
<td>1927-02-10</td>
</tr>
<tr>
<td>734</td>
<td>DR-3</td>
<td>1930-01-07</td>
</tr>
<tr>
<td>735</td>
<td>DR-3</td>
<td>1930-01-12</td>
</tr>
<tr>
<td>751</td>
<td>DR-3</td>
<td>1930-02-26</td>
</tr>
<tr>
<td>752</td>
<td>DR-3</td>
<td>-null-</td>
</tr>
<tr>
<td>837</td>
<td>MSK-4</td>
<td>1932-01-14</td>
</tr>
<tr>
<td>844</td>
<td>DR-1</td>
<td>1932-03-22</td>
</tr>
</tbody>
</table>

</div>
<div class="col-md-6">

<p><strong>Survey</strong>: the actual readings.</p>

<table>
<thead>
<tr>
<th>taken</th>
<th>person</th>
<th>quant</th>
<th>reading</th>
</tr>
</thead>
<tbody>
<tr>
<td>619</td>
<td>dyer</td>
<td>rad</td>
<td>9.82</td>
</tr>
<tr>
<td>619</td>
<td>dyer</td>
<td>sal</td>
<td>0.13</td>
</tr>
<tr>
<td>622</td>
<td>dyer</td>
<td>rad</td>
<td>7.8</td>
</tr>
<tr>
<td>622</td>
<td>dyer</td>
<td>sal</td>
<td>0.09</td>
</tr>
<tr>
<td>734</td>
<td>pb</td>
<td>rad</td>
<td>8.41</td>
</tr>
<tr>
<td>734</td>
<td>lake</td>
<td>sal</td>
<td>0.05</td>
</tr>
<tr>
<td>734</td>
<td>pb</td>
<td>temp</td>
<td>-21.5</td>
</tr>
<tr>
<td>735</td>
<td>pb</td>
<td>rad</td>
<td>7.22</td>
</tr>
<tr>
<td>735</td>
<td>-null-</td>
<td>sal</td>
<td>0.06</td>
</tr>
<tr>
<td>735</td>
<td>-null-</td>
<td>temp</td>
<td>-26.0</td>
</tr>
<tr>
<td>751</td>
<td>pb</td>
<td>rad</td>
<td>4.35</td>
</tr>
<tr>
<td>751</td>
<td>pb</td>
<td>temp</td>
<td>-18.5</td>
</tr>
<tr>
<td>751</td>
<td>lake</td>
<td>sal</td>
<td>0.1</td>
</tr>
<tr>
<td>752</td>
<td>lake</td>
<td>rad</td>
<td>2.19</td>
</tr>
<tr>
<td>752</td>
<td>lake</td>
<td>sal</td>
<td>0.09</td>
</tr>
<tr>
<td>752</td>
<td>lake</td>
<td>temp</td>
<td>-16.0</td>
</tr>
<tr>
<td>752</td>
<td>roe</td>
<td>sal</td>
<td>41.6</td>
</tr>
<tr>
<td>837</td>
<td>lake</td>
<td>rad</td>
<td>1.46</td>
</tr>
<tr>
<td>837</td>
<td>lake</td>
<td>sal</td>
<td>0.21</td>
</tr>
<tr>
<td>837</td>
<td>roe</td>
<td>sal</td>
<td>22.5</td>
</tr>
<tr>
<td>844</td>
<td>roe</td>
<td>rad</td>
<td>11.25</td>
</tr>
</tbody>
</table>

</div>
</div>


## Q3) Use a type 2 nested query to perform the following: 

Write a SELECT statement that returns all of the people who have not made a temperature reading

In [6]:
%%sql
SELECT p.personal, p.family
FROM Person p 
WHERE p.id NOT IN (
    SELECT DISTINCT person
    FROM Survey
    WHERE person IS NOT NULL
    )

 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dsa_ro
1 rows affected.

[('Frank', 'Danforth')]

## Nested Table Expressions

A Nested Table Expression is the specification of a subquery in the FROM clause of an SQL SELECT statement.

Using our favorite DVD rental database!

In [7]:
%load_ext sql
%sql postgres://dsa_ro_user:readonly@pgsql.dsa.lan/dvdrental

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: dsa_ro_user@dvdrental'

## Q4) Use a nested query to perform the following:
Write a query to find the number of actors who have appeared in more than 35 movies

In [8]:
%%sql
SELECT COUNT(*) AS "actors_w/_more_than_35_movies"
FROM (
    SELECT actor_id, COUNT(*) 
    FROM film_actor 
    GROUP BY actor_id 
    HAVING COUNT(*) > 35
    ) as movie_counts;

   postgres://dsa_ro_user:***@pgsql.dsa.lan/dsa_ro
 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dvdrental
1 rows affected.

[(6,)]

In [9]:
%%sql
SELECT actor_id, COUNT(*) 
    FROM film_actor 
    GROUP BY actor_id 
    HAVING COUNT(*) > 35

   postgres://dsa_ro_user:***@pgsql.dsa.lan/dsa_ro
 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dvdrental
6 rows affected.

[(81, 36), (198, 40), (181, 39), (107, 42), (102, 41), (23, 37)]

## Q5) Use a nested query to perform the following:
Write a query to find the total number of rentals made by those renters who have checked out over 170 days of films

In [10]:
%%sql
SELECT rental_totals.total_time AS days_rented, c.first_name, c.last_name, rental_totals.rentals AS total_rentals
FROM customer c 
INNER JOIN (
        SELECT customer_id
        ,COUNT(rental_id) as rentals
        ,SUM(return_date - rental_date) AS total_time
        FROM rental 
        GROUP BY customer_id 
        HAVING SUM(return_date - rental_date) > '170 days'::interval
    ) as rental_totals
USING (customer_id);

   postgres://dsa_ro_user:***@pgsql.dsa.lan/dsa_ro
 * postgres://dsa_ro_user:***@pgsql.dsa.lan/dvdrental
61 rows affected.

[(datetime.timedelta(days=187, seconds=49680), 'Elizabeth', 'Brown', 38),
 (datetime.timedelta(days=185, seconds=24840), 'Maria', 'Miller', 33),
 (datetime.timedelta(days=189, seconds=4980), 'Michelle', 'Clark', 35),
 (datetime.timedelta(days=180, seconds=35220), 'Jessica', 'Hall', 34),
 (datetime.timedelta(days=177, seconds=52380), 'Melissa', 'King', 34),
 (datetime.timedelta(days=172, seconds=43560), 'Martha', 'Gonzalez', 34),
 (datetime.timedelta(days=191, seconds=37620), 'Diane', 'Collins', 35),
 (datetime.timedelta(days=177, seconds=45840), 'Janice', 'Ward', 34),
 (datetime.timedelta(days=189, seconds=81600), 'Tammy', 'Sanders', 41),
 (datetime.timedelta(days=177, seconds=13020), 'Lori', 'Wood', 31),
 (datetime.timedelta(days=175, seconds=15840), 'Julia', 'Flores', 32),
 (datetime.timedelta(days=178, seconds=5940), 'Lois', 'Butler', 35),
 (datetime.timedelta(days=182, seconds=2280), 'Crystal', 'Ford', 33),
 (datetime.timedelta(days=179, seconds=18960), 'Sherry', 'Marshall', 34),
 (datetime.timedelta(days=170, seconds=60), 'Carrie', 'Porter', 34),
 (datetime.timedelta(days=229, seconds=16200), 'Rhonda', 'Kennedy', 39),
 (datetime.timedelta(days=235, seconds=3480), 'Clara', 'Shaw', 42),
 (datetime.timedelta(days=170, seconds=6120), 'Joanne', 'Robertson', 34),
 (datetime.timedelta(days=243, seconds=8220), 'Eleanor', 'Hunt', 46),
 (datetime.timedelta(days=185, seconds=2340), 'Regina', 'Berry', 34),
 (datetime.timedelta(days=179, seconds=53100), 'Bernice', 'Willis', 33),
 (datetime.timedelta(days=210, seconds=33900), 'June', 'Carroll', 37),
 (datetime.timedelta(days=214, seconds=24120), 'Marion', 'Snyder', 39),
 (datetime.timedelta(days=198, seconds=8520), 'Ana', 'Bradley', 34),
 (datetime.timedelta(days=180, seconds=69720), 'Brittany', 'Riley', 28),
 (datetime.timedelta(days=196, seconds=3300), 'Sue', 'Peters', 40),
 (datetime.timedelta(days=199, seconds=1800), 'Gertrude', 'Castillo', 34),
 (datetime.timedelta(days=172, seconds=60180), 'Tonya', 'Chapman', 32),
 (datetime.timedelta(days=179, seconds=44340), 'Stacey', 'Montgomery', 34),
 (datetime.timedelta(days=205, seconds=69480), 'Marcia', 'Dean', 42),
 (datetime.timedelta(days=178, seconds=48840), 'Tanya', 'Gilbert', 33),
 (datetime.timedelta(days=173, seconds=76080), 'Glenda', 'Frazier', 32),
 (datetime.timedelta(days=173, seconds=29820), 'Viola', 'Hanson', 32),
 (datetime.timedelta(days=181, seconds=71820), 'Marsha', 'Douglas', 37),
 (datetime.timedelta(days=189, seconds=24060), 'Lena', 'Jensen', 32),
 (datetime.timedelta(days=176, seconds=58080), 'Margie', 'Wade', 36),
 (datetime.timedelta(days=183, seconds=27240), 'Priscilla', 'Lowe', 35),
 (datetime.timedelta(days=176, seconds=34440), 'Naomi', 'Jennings', 35),
 (datetime.timedelta(days=175, seconds=1140), 'Mae', 'Fletcher', 31),
 (datetime.timedelta(days=221, seconds=26460), 'Daisy', 'Bates', 38),
 (datetime.timedelta(days=187, seconds=82980), 'Roger', 'Quintanilla', 36),
 (datetime.timedelta(days=170, seconds=72240), 'Justin', 'Ngo', 36),
 (datetime.timedelta(days=178, seconds=46200), 'Ralph', 'Madrigal', 34),
 (datetime.timedelta(days=199, seconds=85560), 'Brandon', 'Huey', 37),
 (datetime.timedelta(days=173, seconds=66360), 'Billy', 'Poulin', 35),
 (datetime.timedelta(days=193, seconds=73800), 'Louis', 'Leone', 35),
 (datetime.timedelta(days=188, seconds=76740), 'Russell', 'Brinson', 36),
 (datetime.timedelta(days=175, seconds=44220), 'Philip', 'Causey', 31),
 (datetime.timedelta(days=197, seconds=61320), 'Curtis', 'Irby', 38),
 (datetime.timedelta(days=188, seconds=82380), 'Troy', 'Quigley', 30),
 (datetime.timedelta(days=178, seconds=58920), 'Alexander', 'Fennell', 36),
 (datetime.timedelta(days=190, seconds=54720), 'Tommy', 'Collazo', 38),
 (datetime.timedelta(days=174, seconds=51180), 'Warren', 'Sherrod', 33),
 (datetime.timedelta(days=218, seconds=5400), 'Tim', 'Cary', 39),
 (datetime.timedelta(days=221, seconds=6360), 'Wesley', 'Bull', 40),
 (datetime.timedelta(days=185, seconds=57840), 'Leslie', 'Seward', 35),
 (datetime.timedelta(days=175, seconds=42360), 'Mitchell', 'Westmoreland', 32),
 (datetime.timedelta(days=194, seconds=73800), 'Arnold', 'Havens', 33),
 (datetime.timedelta(days=264, seconds=13080), 'Karl', 'Seal', 45),
 (datetime.timedelta(days=195, seconds=2820), 'Neil', 'Renner', 32),
 (datetime.timedelta(days=174, seconds=70140), 'Casey', 'Mena', 34)]

# Save your Notebook, then `File > Close and Halt`